Cesar-Dk/Pulses/Middlewares/ST/STM32_UART_EMUL_Library/Src/stm32l4xx_hal_uart_emul.c
  tmp = __HAL_UART_EMUL_GET_FLAG(huart, UART_EMUL_FLAG_PE);
  /* UART Emulation parity error  occurred */
  if (tmp != RESET)
  {
    __HAL_UART_EMUL_CLEAR_FLAG(huart, UART_EMUL_FLAG_PE);

    huart->ErrorCode |= HAL_UART_EMUL_ERROR_PE;
  }

  tmp = __HAL_UART_EMUL_GET_FLAG(huart, UART_EMUL_FLAG_FE);
  /* UART Emulation frame error occurred */
  if (tmp != RESET)
  {
    __HAL_UART_EMUL_CLEAR_FLAG(huart, UART_EMUL_FLAG_FE);

    huart->ErrorCode |= HAL_UART_EMUL_ERROR_FE;
  }

  tmp = __HAL_UART_EMUL_GET_FLAG(huart, UART_EMUL_FLAG_TC);
  /* UART Emulation in mode Transmitter */
  if ((tmp != RESET))
  {
    __HAL_UART_EMUL_CLEAR_FLAG(huart, UART_EMUL_FLAG_TC);
  }

  tmp = __HAL_UART_EMUL_GET_FLAG(huart, UART_EMUL_FLAG_RC);
  /* UART Emulation in mode Receiver */
  if ((tmp != RESET))
  {
    __HAL_UART_EMUL_CLEAR_FLAG(huart, UART_EMUL_FLAG_RC);
  }

  if (huart->ErrorCode != HAL_UART_EMUL_ERROR_NONE)
  {
    /* Set the UART Emulation state ready to be able to start again the process */
    huart->State = HAL_UART_EMUL_STATE_READY;

    HAL_UART_Emul_ErrorCallback(huart);
  }
}

/**
  * @}
  */

/** @defgroup UART_Emulation_Group3 Peripheral State and Errors functions
  *  @brief   UART Emulation State and Errors functions
  *
@verbatim
  ==============================================================================
                 ##### Peripheral State and Errors functions #####
  ==============================================================================
 [..]
   This subsection provides a set of functions allowing to return the State of
   UART Emulation communication process, return Peripheral Errors occured during communication
   process
   (+) HAL_UART_Emul_GetState() API can be helpful to check in run-time the state of the UART Emulation.
   (+) HAL_UART_Emul_GetError() check in run-time errors that could be occured durung communication.

@endverbatim
  * @{
  */

/**
  * @brief  Returns the UART Emulation state.
  * @param  huart: UART Emulation handle
  * @retval HAL state
  */
HAL_UART_Emul_StateTypeDef HAL_UART_Emul_GetState(UART_Emul_HandleTypeDef *huart)
{
  return huart->State;
}

/**
* @brief  Return the UART Emulation error code
* @param  huart : pointer to UART_Emul_HandleTypeDef structure that contains
  *              the configuration information for the specified UART Emulation.
* @retval UART Emulation Error Code
*/
uint32_t HAL_UART_Emul_GetError(UART_Emul_HandleTypeDef *huart)
{
  return huart->ErrorCode;
}

/**
  * @}
  */
/*===============================================================================
            #####  Private function for UART Emulation #####
  ===============================================================================
*/

/**
  * @brief  This function is executed in case of Receive Complete for last frame.
  * @param  None
  * @retval None
  */
static void UART_Emul_DMAReceiveCplt(DMA_HandleTypeDef *hdma)
{
  uint32_t tmpformat = 0;
  uint32_t tmpdata = 0;

#if 0
  if (huart_emul->RxXferCount > huart_emul->RxXferSize)
  {
    /*Disable EXTI line Rx  */
    EXTI->IMR1 &= ~huart_emul->Init.RxPinNumber;

    if ((huart_emul->RxXferCount % 2) == 0)
    {
      tmpformat = (uint32_t)pFirstBuffer_Rx;
    }

    else
    {
      tmpformat = (uint32_t)pSecondBuffer_Rx;
    }
 
    /* Formatted Last Frame */
    *(uint8_t*)((huart_emul->pRxBuffPtr) + (huart_emul->RxXferCount - 2)) = UART_Emul_ReceiveFormatFrame(huart_emul, (uint32_t*)tmpformat, (uint8_t)tmpdata);

    /* Set RC falg receiver complete */
    __HAL_UART_EMUL_SET_FLAG(huart_emul, UART_EMUL_FLAG_RC);

    /* De_Initialize counter frame for Rx */
    huart_emul->RxXferCount = 0;

    /* Initialize the UART Emulation  state */
    huart_emul->ErrorCode = HAL_UART_EMUL_ERROR_NONE;

    /* Check if a transmit process is ongoing or not */
    if (huart_emul->State == HAL_UART_EMUL_STATE_BUSY_TX_RX)
    {
      huart_emul->State = HAL_UART_EMUL_STATE_BUSY_TX;
    }
    else
    {
      huart_emul->State = HAL_UART_EMUL_STATE_READY;
    }

    /* Handle for UART Emulation Receive Complete */
    HAL_UART_Emul_RxCpltCallback(huart_emul);
  }
#endif
#if 1
  /* Handle for UART Emulation Receive Complete */
  if ( num_rx_bytes > num_rx_bytes_last )
  {
	  num_rx_bytes_last = num_rx_bytes;
	  if ((huart_emul->RxXferCount % 2) == 0)
	  {
		  tmpformat = (uint32_t)pFirstBuffer_Rx;
	  }
	  else
	  {
		  tmpformat = (uint32_t)pSecondBuffer_Rx;
	  }

	  /* Formatted Last Frame */
	  *(uint8_t*)((huart_emul->pRxBuffPtr) + (huart_emul->RxXferCount - 2)) = UART_Emul_ReceiveFormatFrame(huart_emul, (uint32_t*)tmpformat, (uint8_t)tmpdata);
	  HAL_UART_Emul_RxCpltCallback(huart_emul);
  }
  else
  {
	  /*Disable EXTI line Rx  */
	  EXTI->IMR1 &= ~huart_emul->Init.RxPinNumber;

	  /* Deinitialize TIMx DMA handle */
	  HAL_DMA_DeInit(TimHandle.hdma[TIM_DMA_ID_CC2]);
	  HAL_TIM_Base_DeInit(&TimHandle);
//	  HAL_TIM_Base_Stop(&htim3);
//	  unselected 		= 0;
//	  time_counter      = 0;
	  num_rx_bytes      = 0;
	  num_rx_bytes_last = 0;

	  /* Set RC falg receiver complete */
	  __HAL_UART_EMUL_SET_FLAG(huart_emul, UART_EMUL_FLAG_RC);

	  /* De_Initialize counter frame for Rx */
	  huart_emul->RxXferCount = 0;

	  /* Initialize the UART Emulation  state */
	  huart_emul->ErrorCode = HAL_UART_EMUL_ERROR_NONE;

	  /* Check if a transmit process is ongoing or not */
	  if (huart_emul->State == HAL_UART_EMUL_STATE_BUSY_TX_RX)
	  {
		  huart_emul->State = HAL_UART_EMUL_STATE_BUSY_TX;
	  }
	  else
	  {
		  huart_emul->State = HAL_UART_EMUL_STATE_READY;//HAL_UART_EMUL_STATE_RESET;
	  }
  }
#endif
}

/**
 * @brief  Receives an amount of Frames.
 * @param  huart: UART Emulation handle
 * @param  pData: Frame to be Received
 * @retval None
*/
static void UART_Emul_ReceiveFrame(UART_Emul_HandleTypeDef *huart, uint32_t *pData)
{
	uint32_t tmp_sr =0;
	uint32_t tmp_ds =0;
	uint32_t tmp_size =0;
	uint32_t tmp_arr =0;

	tmp_arr  = TIM1->ARR;
	tmp_ds   = (uint32_t)pData;
	tmp_sr   = (uint32_t) & (huart->RxPortName->IDR);
	tmp_size =  __HAL_UART_EMUL_FRAME_LENGTH(huart);

