Cesar-Dk/Pulses/Middlewares/ST/STM32_UART_EMUL_Library/Src/stm32l4xx_hal_uart_emul.c
    /* Disable the peripheral */
    __HAL_DMA_DISABLE(&hdma_rx);

    /* Disable the Capture compare channel */
    TIM_CCxChannelCmd(TIM1, TIM_CHANNEL_2, TIM_CCx_DISABLE);

    /* Disable the peripheral */
    __HAL_TIM_DISABLE(&TimHandle);

    /* Clear all flags */
    hdma_rx.DmaBaseAddress->IFCR = (DMA_ISR_GIF1 << (hdma_rx.ChannelIndex & 0x1CU));

	/* Configure DMA Stream data length */
	hdma_rx.Instance->CNDTR = tmp_size;

	/* Configure DMA Stream source address */
	hdma_rx.Instance->CPAR = tmp_sr;

	/* Configure DMA Stream destination address */
	hdma_rx.Instance->CMAR = tmp_ds;

	/* Enable the transfer complete interrupt */
	__HAL_DMA_ENABLE_IT(&hdma_rx, DMA_IT_TC);

	/* Enable the transfer Error interrupt */
	__HAL_DMA_ENABLE_IT(&hdma_rx, DMA_IT_TE);

	/* Enable the Peripheral */
	__HAL_DMA_ENABLE(&hdma_rx);

	if ((huart_emul->RxXferCount == 1)||(huart->State != HAL_UART_EMUL_STATE_BUSY_TX_RX))
	{
		TIM1->CCR2 = ((TIM1->CNT + (tmp_arr / 2)) % tmp_arr);
	}

	/* Enable the TIM Update DMA request */
	__HAL_TIM_ENABLE_DMA(&TimHandle, TIM_DMA_CC2);

    /* Enable the Capture compare channel */
    TIM_CCxChannelCmd(TIM1, TIM_CHANNEL_2, TIM_CCx_ENABLE);

	/* Enable Timer */
	__HAL_TIM_ENABLE(&TimHandle);

}

/**
  * @brief  Configures the UART Emulation peripheral
             + Enable clock for all peripherals Timer, GPIO
             + DMA2 Configuration channel, Stream, Mode,...
  * @param  huart: UART Emulation handle
  * @retval None
  */
static void UART_Emul_SetConfig (UART_Emul_HandleTypeDef *huart)
{
	uint32_t bit_time = 0;

	/* Check the parameters */
	assert_param(IS_UART_EMUL_BAUDRATE(huart->Init.BaudRate));
	assert_param(IS_UART_EMUL_WORD_LENGTH(huart->Init.WordLength));
	assert_param(IS_UART_EMUL_STOPBITS(huart->Init.StopBits));
	assert_param(IS_UART_EMUL_MODE(huart->Init.Mode));
	assert_param(IS_UART_EMUL_MODE(huart->Init.Parity));

	/* Init Bit Time */
	if((HAL_RCC_GetSysClockFreq()/HAL_RCC_GetPCLK2Freq()== 1) | (HAL_RCC_GetSysClockFreq()/HAL_RCC_GetPCLK2Freq()== 2))
	{
		bit_time = ((uint32_t) ((HAL_RCC_GetSysClockFreq()/huart->Init.BaudRate) - 1));
	}
	else
	{
		bit_time = ((uint32_t) (((HAL_RCC_GetPCLK2Freq()*2)/huart->Init.BaudRate) - 1));
	}

	/*##-1- Configure  the Timer peripheral (TIM1) in Bit Delay ##############*/
	/* Initialize TIM1 peripheral as follow:
  + Period = TimerPeriod 
  + Prescaler = 0
  + ClockDivision = 0
  + Counter direction = Up
	 */
	TimHandle.Instance            = TIM1;
	TimHandle.Init.Period         = bit_time;
	TimHandle.Init.Prescaler      = 0;
	TimHandle.Init.ClockDivision  = 0;
	TimHandle.Init.CounterMode    = TIM_COUNTERMODE_UP;
	HAL_TIM_Base_Init(&TimHandle);

	if (huart->Init.Mode == UART_EMUL_MODE_TX)
	{
		/* Configure UART Emulation in Transmission mode */
		UART_Emul_SetConfig_DMATx();
	}
	else if (huart->Init.Mode == UART_EMUL_MODE_RX)
	{
		/* Configure UART Emulation in Reception mode */
		UART_Emul_SetConfig_DMARx();
	}
	else
	{
		/* Configure UART Emulation in full-duplex mode */
		UART_Emul_SetConfig_DMATx();
		UART_Emul_SetConfig_DMARx();
	}
}

/**
  * @brief  Configures the DMA for UART Emulation transmission.
             + DMA2 Configuration channel, Stream, Mode, ...
  * @param  None
  * @retval None
  */
static void UART_Emul_SetConfig_DMATx(void)
{
  /* Init Idle */
  HAL_GPIO_WritePin((huart_emul->TxPortName), (huart_emul->Init.TxPinNumber), GPIO_PIN_SET);

  /*##-1- Configure  DMA For UART Emulation TX #############################*/
  /* Set the parameters to be configured */
  hdma_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;         /* Transfer mode                        */
  hdma_tx.Init.PeriphInc           = DMA_PINC_DISABLE;             /* Peripheral increment mode Disable    */
  hdma_tx.Init.MemInc              = DMA_MINC_ENABLE;              /* Memory increment mode Enable         */
  hdma_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD ;         /* Peripheral data alignment : Word     */
  hdma_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD ;         /* memory data alignment :  Word        */
  hdma_tx.Init.Mode                = DMA_NORMAL;                   /* Normal DMA mode                      */
  hdma_tx.Init.Priority            = DMA_PRIORITY_VERY_HIGH;       /* priority level : very high           */
  hdma_tx.Init.Request             = DMA_REQUEST_7;

  /* Set hdma_tim instance */
  hdma_tx.Instance = DMA1_Channel2;
  hdma_tx.Parent = TimHandle.hdma[TIM_DMA_ID_CC1];

  /* Link hdma_tim to hdma[ ] ( channel Tx or Rx) */
  __HAL_LINKDMA(&TimHandle, hdma[TIM_DMA_ID_CC1] , hdma_tx);

  /* Initialize TIMx DMA handle */
  HAL_DMA_Init(TimHandle.hdma[TIM_DMA_ID_CC1]);

  /*##-2- NVIC configuration for DMA transfer complete interrupt ###########*/
  HAL_NVIC_SetPriority(DMA1_Channel2_IRQn, 3, 3);
  HAL_NVIC_EnableIRQ(DMA1_Channel2_IRQn);
}

/**
  * @brief  Configures the DMA for UART Emulation reception.
             + DMA2 Configuration channel, Stream, Mode, ...
  * @param  None
  * @retval None
  */
static void UART_Emul_SetConfig_DMARx(void)
{
  /*##-1- Configure  DMA For UART Emulation RX #############################*/
  /* Set the parameters to be configured */
  hdma_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;         /* Transfer mode                        */
  hdma_rx.Init.PeriphInc           = DMA_PINC_DISABLE;             /* Peripheral increment mode Disable    */
  hdma_rx.Init.MemInc              = DMA_MINC_ENABLE;              /* Memory increment mode Enable         */
  hdma_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;          /* Peripheral data alignment :Word      */
  hdma_rx.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;          /* memory data alignment : Word         */
  hdma_rx.Init.Mode                = DMA_CIRCULAR;                 /* Circular DMA mode                    */
  hdma_rx.Init.Priority            = DMA_PRIORITY_VERY_HIGH;       /* priority level : very high           */
  hdma_rx.Init.Request             = DMA_REQUEST_7;

