Cesar-Dk/Pulses/Middlewares/ST/STM32_UART_EMUL_Library/Src/stm32l4xx_hal_uart_emul.c
  /* Set hdma_tim instance */
  hdma_rx.Instance = DMA1_Channel3;
//  hdma_rx.Parent = TimHandle.hdma[TIM_DMA_ID_CC2];

  /* Link hdma_tim to hdma[ ] ( channel Tx or Rx) */
  __HAL_LINKDMA(&TimHandle, hdma[TIM_DMA_ID_CC2], hdma_rx);

  /* Initialize TIMx DMA handle */
  HAL_DMA_Init(TimHandle.hdma[TIM_DMA_ID_CC2]);

  /*##-2- NVIC configuration for DMA transfer complete interrupt ###########*/
  HAL_NVIC_SetPriority(DMA1_Channel3_IRQn, 0, 1);
  HAL_NVIC_EnableIRQ(DMA1_Channel3_IRQn);
}

/**
 * @brief  Format Frame in Receiver mode.
 * @param  huart: UART Emulation handle
 * @param  pBuffer: pointer of receiver Buffer
 * @param  pFrame: pointer of Frame
 * @retval None
*/
static uint8_t UART_Emul_ReceiveFormatFrame(UART_Emul_HandleTypeDef *huart, uint32_t *pBuf, uint8_t Data)
{ 
  uint32_t counter = 0;
  uint32_t length = 0;
  uint32_t tmp = 0;
  uint32_t cntparity = 0;

  if (huart->Init.Parity != UART_EMUL_PARITY_NONE)
  {
    /* Get Length of frame */
    length = huart->Init.WordLength -1 ;
  }
  else
  {
    /* Get Length of frame */
    length = huart->Init.WordLength ;
  }

  if ((pBuf[huart->Init.WordLength+1]&huart->Init.RxPinNumber) != huart->Init.RxPinNumber)
  {
    /* UART Emulation frame error occurred */
    __HAL_UART_EMUL_SET_FLAG(huart_emul, UART_EMUL_FLAG_FE);

    huart->ErrorCode |= HAL_UART_EMUL_ERROR_FE;

    /* Disable External interrupt for next Frame */
    EXTI->IMR1 &= ~huart_emul->Init.RxPinNumber;

    /* Handle for UART Emulation Error */
    HAL_UART_Emul_ErrorCallback(huart);

    tmp = RESET;
  }
  else
  {
    /* format data */
    for (counter = 0; counter < length; counter++)
    {
      if ((pBuf[counter+1]&(huart->Init.RxPinNumber)) == (huart->Init.RxPinNumber))
      {
        Data = (0x01 << counter) | Data;
        cntparity ++;
      }
    }
    /* Parity Bit */
    if (huart->Init.Parity == UART_EMUL_PARITY_ODD)
    {
			
      if (((cntparity % 2) != SET) && ((pBuf[length+1]&huart->Init.RxPinNumber) != huart->Init.RxPinNumber))
      {
        /* Set flag PE */
        __HAL_UART_EMUL_SET_FLAG(huart, UART_EMUL_FLAG_PE);

        HAL_UART_Emul_ErrorCallback(huart);
      }
    }
    if (huart->Init.Parity == UART_EMUL_PARITY_EVEN)
    {

      if (((cntparity % 2) != RESET) && ((pBuf[length+1]&huart->Init.RxPinNumber) != huart->Init.RxPinNumber))
      {
        /* UART Emulation parity error occurred */
        __HAL_UART_EMUL_SET_FLAG(huart, UART_EMUL_FLAG_PE);

        huart->ErrorCode |= HAL_UART_EMUL_ERROR_PE;

        HAL_UART_Emul_ErrorCallback(huart);
      }
    }

    /* Reset counter parity */
    cntparity = 0;

    tmp = Data;
  }

  return tmp;
}
/**
  * @brief  This function formats one Frame
  * @param  UART Emulation Handle
  * @param  pdata pinteur in data
  * @retval None
  */
static void UART_Emul_TransmitFormatFrame(UART_Emul_HandleTypeDef *huart , uint8_t Data, uint32_t *pBuffer_Tx)
{
	uint32_t counter = 0;
	uint32_t bitmask = 0;
	uint32_t length = 0;
	uint32_t cntparity = 0;

	length = huart->Init.WordLength;

	/* Get the Pin Number */
	bitmask = (uint32_t)huart->Init.TxPinNumber;

	/* with no parity */
	if(huart->Init.Parity == 0x00)
	{
		for (counter = 0; counter < length; counter++)
		{
			if (((Data >> counter)&BitMask) != 0)
			{
				pBuffer_Tx[counter+1] = bitmask;
			}
			else
			{
				pBuffer_Tx[counter+1] = (bitmask << 16);
			}
		}
	}
	/* with parity */
	else
	{
		for (counter = 0; counter < length-1; counter++)
		{
			if (((Data >> counter)&BitMask) != 0)
			{
				pBuffer_Tx[counter+1] = bitmask;
				cntparity ++;
			}
			else
			{
				pBuffer_Tx[counter+1] = (bitmask << 16);
			}
		}
	}

	switch  (huart->Init.Parity)
	{
	case UART_EMUL_PARITY_ODD:
	{
		/* Initialize Parity Bit */
		if ((cntparity % 2) != SET)
		{
			pBuffer_Tx[length] = bitmask;
		}
		else
		{
			pBuffer_Tx[length] = (bitmask << 16);
		}

	}
	break;
	case UART_EMUL_PARITY_EVEN:
	{
		/* Initialize Parity Bit */
		if ((cntparity % 2) != SET)
		{
			pBuffer_Tx[length] = (bitmask << 16);
		}
		else
		{
			pBuffer_Tx[length] = bitmask;
		}
	}
	break;
	default:
		break;
	}
	/* Initialize Bit Start */
	pBuffer_Tx[0] = (bitmask << 16);

	if (huart->Init.StopBits == UART_EMUL_STOPBITS_1)
	{
		/* Initialize Bit Stop  */
		pBuffer_Tx[length+1] = bitmask;
	}
	else
	{
		/* Initialize Bit Stop  */
		pBuffer_Tx[length+1] = bitmask;
		pBuffer_Tx[length+2] = bitmask;
	}
	/* Reset counter parity */
	cntparity = 0;
}

/**
  * @brief  Sends an amount of Frames
  * @param  huart: UART Emulation handle
  * @param  pData: Frame to be sent
  * @retval None
  */
static void UART_Emul_TransmitFrame(UART_Emul_HandleTypeDef *huart)
{
	uint32_t tmp_sr = 0;
	uint32_t tmp_ds = 0;
	uint32_t tmp_size = 0;

	if ((huart_emul->TxXferCount % 2 ) != 0)
	{
		tmp_sr = (uint32_t)pFirstBuffer_Tx;
	}
	else
	{
		tmp_sr = (uint32_t)pSecondBuffer_Tx;
	}

	tmp_ds = (uint32_t) & ((huart->TxPortName)->BSRR);

	tmp_size = __HAL_UART_EMUL_FRAME_LENGTH(huart);
	
    /* Disable the peripheral */
    __HAL_DMA_DISABLE(&hdma_tx);

    /* Disable the Capture compare channel */
    TIM_CCxChannelCmd(TIM1, TIM_CHANNEL_1, TIM_CCx_DISABLE);

    /* Disable the peripheral */
    __HAL_TIM_DISABLE(&TimHandle);

    /* Clear all flags */
    hdma_tx.DmaBaseAddress->IFCR = (DMA_ISR_GIF1 << (hdma_tx.ChannelIndex & 0x1CU));

	/* Configure DMA Stream data length */
	hdma_tx.Instance->CNDTR = tmp_size;

	/* Configure DMA Stream destination address */
	hdma_tx.Instance->CPAR = tmp_ds;

	/* Configure DMA Stream source address */
	hdma_tx.Instance->CMAR = tmp_sr;

	/* Enable the transfer complete interrupt */
	__HAL_DMA_ENABLE_IT(&hdma_tx, DMA_IT_TC);

	/* Enable the transfer Error interrupt */
	__HAL_DMA_ENABLE_IT(&hdma_tx, DMA_IT_TE);

	/* Enable the Peripheral */
	__HAL_DMA_ENABLE(&hdma_tx);

	/* Enable the TIM Update DMA request */
	__HAL_TIM_ENABLE_DMA(&TimHandle, TIM_DMA_CC1);

    /* Enable the Capture compare channel */
    TIM_CCxChannelCmd(TIM1, TIM_CHANNEL_1, TIM_CCx_ENABLE);

	/* Enable the Peripheral */
	__HAL_TIM_ENABLE(&TimHandle);

