Cesar-Dk/Pulses/Middlewares/ST/STM32_UART_EMUL_Library/Src/stm32l4xx_hal_uart_emul.c
}

/**
  * @brief  This function is executed in case of Transfer Complete of a Frame.
  * @param  None
  * @retval None
  */
static void UART_Emul_DMATransmitCplt(DMA_HandleTypeDef *hdma)
{
  uint32_t tmpbuffer = 0;

  /* Incremente Counter of frame */
  huart_emul->TxXferCount++;

  if (huart_emul->TxXferCount <= huart_emul->TxXferSize)
  { 

    /* Call UART Emulation Transmit frame for next Frame */
    UART_Emul_TransmitFrame(huart_emul);

    if ((huart_emul->TxXferCount % 2 ) != 0)
    {
      tmpbuffer = (uint32_t)pSecondBuffer_Tx;
    }
    else
    {
      tmpbuffer = (uint32_t)pFirstBuffer_Tx;
    }
    /* Format second Data to be sent */
    UART_Emul_TransmitFormatFrame(huart_emul, *(huart_emul->pTxBuffPtr + huart_emul->TxXferCount), (uint32_t*)tmpbuffer);

    /* Handle for UART Emulation Transfer Complete */
    HAL_UART_Emul_TxCpltCallback(huart_emul);

  }
  else
  {
    /* Disable the transfer complete interrupt */
    __HAL_DMA_DISABLE_IT(TimHandle.hdma[TIM_DMA_ID_CC1], DMA_IT_TC);

    /* Set TC flag in the status register software */
    __HAL_UART_EMUL_SET_FLAG(huart_emul, UART_EMUL_FLAG_TC);

    /* De_Initialize counter frame for Tx */
    huart_emul->TxXferCount = 0;

    /* Initialize the UART Emulation state */
    huart_emul->ErrorCode = HAL_UART_EMUL_ERROR_NONE;

    /* Check if a receive process is ongoing or not */
    if (huart_emul->State == HAL_UART_EMUL_STATE_BUSY_TX_RX)
    {
      huart_emul->State = HAL_UART_EMUL_STATE_BUSY_RX;
    }
    else
    {
      huart_emul->State = HAL_UART_EMUL_STATE_READY;
    }
    /* Handle for UART Emulation Transfer Complete */
    HAL_UART_Emul_TxCpltCallback(huart_emul);
  }
}

/**
  * @brief  This function is executed in case of error of Transfer occurrence.
  * @param  hdma : DMA Handle
  * @retval None
  */
static void UART_Emul_DMAError(DMA_HandleTypeDef *hdma)
{
  /* UART Emulation frame error occurred */
  __HAL_UART_EMUL_SET_FLAG(huart_emul, UART_EMUL_FLAG_FE);

  huart_emul->ErrorCode |= HAL_UART_EMUL_ERROR_FE;

  HAL_UART_Emul_ErrorCallback(huart_emul);
}

/**
  * @brief  Initializes the UART Emulation Transfer Complete.
  * @param  huart: UART Emulation Handle
  * @retval None
  */
__weak void HAL_UART_Emul_TxCpltCallback(UART_Emul_HandleTypeDef *huart)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_UART_Emul_TransferComplete could be implemented in the user file
   */
}

/**
  * @brief  UART Emulation error callbacks.
  * @param  huart: UART Emulation handle
  * @retval None
  */
__weak void HAL_UART_Emul_ErrorCallback(UART_Emul_HandleTypeDef *huart)
{
  /* NOTE: This function Should not be modified, when the callback is needed,
           the HAL_UART_ErrorCallback could be implemented in the user file
   */
}

/**
  * @brief  This function is executed in case of Receive Complete for last frame.
  * @param  None
  * @retval None
  */
void UART_Emul_DMADisableRcpt(void)
{
	/*Disable EXTI line Rx  */
	EXTI->IMR1 &= ~huart_emul->Init.RxPinNumber;

	num_rx_bytes      = 0;
	num_rx_bytes_last = 0;

	/* Set RC falg receiver complete */
	__HAL_UART_EMUL_SET_FLAG(huart_emul, UART_EMUL_FLAG_RC);

	/* De_Initialize counter frame for Rx */
	huart_emul->RxXferCount = 0;

	/* Initialize the UART Emulation  state */
	huart_emul->ErrorCode = HAL_UART_EMUL_ERROR_NONE;

	/* Check if a transmit process is ongoing or not */
	if (huart_emul->State == HAL_UART_EMUL_STATE_BUSY_TX_RX)
	{
		huart_emul->State = HAL_UART_EMUL_STATE_BUSY_TX;
	}
	else
	{
		huart_emul->State = HAL_UART_EMUL_STATE_READY;//HAL_UART_EMUL_STATE_RESET;
	}
}

void UART_Emul_Restart( UART_Emul_HandleTypeDef *huart )
{
//	  HAL_DMA_Init(TimHandle.hdma[TIM_DMA_ID_CC2]);
//	  HAL_TIM_Base_Init(&TimHandle);
	  UART_Emul_SetConfig(huart);
//	  /* Set the UART Emulation DMA transfer complete callback */
//	  TimHandle.hdma[TIM_DMA_ID_CC2]->XferCpltCallback = UART_Emul_DMAReceiveCplt;
	  /* Enable External interrupt for next Frame */
	  EXTI->IMR1 |= huart_emul->Init.RxPinNumber;
}

void UART_Emul_Restart_Tx( void )
{
	UART_Emul_SetConfig_DMATx();
}

void UART_Emul_Disable( void )
{
	HAL_DMA_DeInit(TimHandle.hdma[TIM_DMA_ID_CC1]);
	HAL_DMA_DeInit(TimHandle.hdma[TIM_DMA_ID_CC2]);
	HAL_TIM_Base_DeInit(&TimHandle);
	EXTI->IMR1 &= ~huart_emul->Init.RxPinNumber;
}
/**
  * @}
  */

#endif /* HAL_UART_EMUL_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
